2.2.013/src/Catalogs/МК_НастройкиСвязиЗаявленийКЭДО/МК_НастройкиСвязиЗаявленийКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_НастройкиСвязиЗаявленийКЭДО</name>
  <attributes>
    <name>Опубликован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента1С</name>
    <type>
      <types>EnumRef.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтпуска</name>
    <type>
      <types>CatalogRef.ВидыОтпусков</types>
    </type>
  </attributes>
  <attributes>
    <name>МК_КодШаблона</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействияСЗаявлениями</name>
    <type>
      <types>EnumRef.МК_ДействияСЗаявлениями</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВремени</name>
    <type>
      <types>CatalogRef.ВидыИспользованияРабочегоВремени</types>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/Enums/МК_ОбрабатываемыеВидыДокументовПоЗаявлениям/МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МК_ОбрабатываемыеВидыДокументовПоЗаявлениям</name>
  <enumValues>
    <name>Отпуск</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>Отгул</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствиеССохранениемОплаты</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

2.2.013/src/Catalogs/МК_НастройкиСвязиЗаявленийКЭДО/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ВидДокумента1СПриИзменении(Элемент)
	Если Элемент.Родитель.Объект.ВидДокумента1С = ПредопределенноеЗначение("Перечисление.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.Отпуск") Тогда
		Элементы.ВидОтпуска.Доступность = Истина;     
	Иначе		
		Элементы.ВидОтпуска.Доступность = Ложь;  
		Элемент.Родитель.Объект.ВидОтпуска = Неопределено;
	КонецЕсли;
	Если Элемент.Родитель.Объект.ВидДокумента1С = ПредопределенноеЗначение("Перечисление.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.ОтсутствиеССохранениемОплаты") Тогда
		Элементы.ВидВремени.Доступность = Истина;
	Иначе		
		Элементы.ВидВремени.Доступность = Ложь;  
		Элемент.Родитель.Объект.ВидВремени = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ВидДокумента1С = ПредопределенноеЗначение("Перечисление.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.Отпуск") Тогда
		Элементы.ВидОтпуска.Доступность = Истина;   
	Иначе
		Элементы.ВидОтпуска.Доступность = Ложь;  
		Объект.ВидОтпуска = Неопределено;
	КонецЕсли;       
	Если Объект.ВидДокумента1С = ПредопределенноеЗначение("Перечисление.МК_ОбрабатываемыеВидыДокументовПоЗаявлениям.ОтсутствиеССохранениемОплаты") Тогда
		Элементы.ВидВремени.Доступность = Истина;   
	Иначе
		Элементы.ВидВремени.Доступность = Ложь;  
		Объект.ВидВремени = Неопределено;
	КонецЕсли;
КонецПроцедуры
